In [1]:
import pyodbc
import sqlite3

In [2]:
%reload_ext sql

In [3]:
%sql sqlite:///Loans.db

In [4]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///Loans.db
Done.

[('LoanData',), ('CustomerData',)]

In [5]:
%%sql
SELECT * FROM LoanData limit 5;

 * sqlite:///Loans.db
Done.

[('LP001002', None, 360.0, 'Y'),
 ('LP001003', 128.0, 360.0, 'N'),
 ('LP001005', 66.0, 360.0, 'Y'),
 ('LP001006', 120.0, 360.0, 'Y'),
 ('LP001008', 141.0, 360.0, 'Y')]

In [6]:
%%sql
SELECT * FROM CustomerData limit 5;

 * sqlite:///Loans.db
Done.

[('LP001002', 'Male', 'No', '0', 'Graduate', 'No', 5849, 'Urban', 1.0),
 ('LP001003', 'Male', 'Yes', '1', 'Graduate', 'No', 4583, 'Rural', 1.0),
 ('LP001005', 'Male', 'Yes', '0', 'Graduate', 'Yes', 3000, 'Urban', 1.0),
 ('LP001006', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2583, 'Urban', 1.0),
 ('LP001008', 'Male', 'No', '0', 'Graduate', 'No', 6000, 'Urban', 1.0)]

### Handling Null Values

In [7]:
%%sql
select count(*) from CustomerData where Self_Employed is null

 * sqlite:///Loans.db
Done.

[(32,)]

### Adding a Default Value (UPDATE STATEMENT)

#### Default Self Employed as: NO

In [8]:
%%sql
UPDATE CustomerData
SET Self_Employed = 'No'
WHERE Self_Employed is null;

select* from CustomerData limit 10;

 * sqlite:///Loans.db
32 rows affected.
Done.

[('LP001002', 'Male', 'No', '0', 'Graduate', 'No', 5849, 'Urban', 1.0),
 ('LP001003', 'Male', 'Yes', '1', 'Graduate', 'No', 4583, 'Rural', 1.0),
 ('LP001005', 'Male', 'Yes', '0', 'Graduate', 'Yes', 3000, 'Urban', 1.0),
 ('LP001006', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2583, 'Urban', 1.0),
 ('LP001008', 'Male', 'No', '0', 'Graduate', 'No', 6000, 'Urban', 1.0),
 ('LP001011', 'Male', 'Yes', '2', 'Graduate', 'Yes', 5417, 'Urban', 1.0),
 ('LP001013', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2333, 'Urban', 1.0),
 ('LP001014', 'Male', 'Yes', '3+', 'Graduate', 'No', 3036, 'Semiurban', 0.0),
 ('LP001018', 'Male', 'Yes', '2', 'Graduate', 'No', 4006, 'Urban', 1.0),
 ('LP001020', 'Male', 'Yes', '1', 'Graduate', 'No', 12841, 'Semiurban', 1.0)]

In [9]:
%%sql
select count(*) from CustomerData where Self_Employed is null

 * sqlite:///Loans.db
Done.

[(0,)]

#### Default Credit History: 0.0

In [10]:
%%sql
UPDATE CustomerData
SET Credit_History = 0.0
WHERE Credit_History is null;

select* from CustomerData limit 10;

 * sqlite:///Loans.db
50 rows affected.
Done.

[('LP001002', 'Male', 'No', '0', 'Graduate', 'No', 5849, 'Urban', 1.0),
 ('LP001003', 'Male', 'Yes', '1', 'Graduate', 'No', 4583, 'Rural', 1.0),
 ('LP001005', 'Male', 'Yes', '0', 'Graduate', 'Yes', 3000, 'Urban', 1.0),
 ('LP001006', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2583, 'Urban', 1.0),
 ('LP001008', 'Male', 'No', '0', 'Graduate', 'No', 6000, 'Urban', 1.0),
 ('LP001011', 'Male', 'Yes', '2', 'Graduate', 'Yes', 5417, 'Urban', 1.0),
 ('LP001013', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2333, 'Urban', 1.0),
 ('LP001014', 'Male', 'Yes', '3+', 'Graduate', 'No', 3036, 'Semiurban', 0.0),
 ('LP001018', 'Male', 'Yes', '2', 'Graduate', 'No', 4006, 'Urban', 1.0),
 ('LP001020', 'Male', 'Yes', '1', 'Graduate', 'No', 12841, 'Semiurban', 1.0)]

#### Default Number of Dependents: 0

In [11]:
%%sql
select count(*) from CustomerData where Dependents is null

 * sqlite:///Loans.db
Done.

[(15,)]

In [12]:
%%sql
UPDATE CustomerData
SET Dependents = '0'
WHERE Dependents is null;

select* from CustomerData limit 10;

 * sqlite:///Loans.db
15 rows affected.
Done.

[('LP001002', 'Male', 'No', '0', 'Graduate', 'No', 5849, 'Urban', 1.0),
 ('LP001003', 'Male', 'Yes', '1', 'Graduate', 'No', 4583, 'Rural', 1.0),
 ('LP001005', 'Male', 'Yes', '0', 'Graduate', 'Yes', 3000, 'Urban', 1.0),
 ('LP001006', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2583, 'Urban', 1.0),
 ('LP001008', 'Male', 'No', '0', 'Graduate', 'No', 6000, 'Urban', 1.0),
 ('LP001011', 'Male', 'Yes', '2', 'Graduate', 'Yes', 5417, 'Urban', 1.0),
 ('LP001013', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2333, 'Urban', 1.0),
 ('LP001014', 'Male', 'Yes', '3+', 'Graduate', 'No', 3036, 'Semiurban', 0.0),
 ('LP001018', 'Male', 'Yes', '2', 'Graduate', 'No', 4006, 'Urban', 1.0),
 ('LP001020', 'Male', 'Yes', '1', 'Graduate', 'No', 12841, 'Semiurban', 1.0)]

#### Default Marriage Status: NO

In [13]:
%%sql
select count(*) from CustomerData where Married is null

 * sqlite:///Loans.db
Done.

[(3,)]

In [14]:
%%sql
UPDATE CustomerData
SET Married = 'No'
WHERE Married is null;

select* from CustomerData limit 10;

 * sqlite:///Loans.db
3 rows affected.
Done.

[('LP001002', 'Male', 'No', '0', 'Graduate', 'No', 5849, 'Urban', 1.0),
 ('LP001003', 'Male', 'Yes', '1', 'Graduate', 'No', 4583, 'Rural', 1.0),
 ('LP001005', 'Male', 'Yes', '0', 'Graduate', 'Yes', 3000, 'Urban', 1.0),
 ('LP001006', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2583, 'Urban', 1.0),
 ('LP001008', 'Male', 'No', '0', 'Graduate', 'No', 6000, 'Urban', 1.0),
 ('LP001011', 'Male', 'Yes', '2', 'Graduate', 'Yes', 5417, 'Urban', 1.0),
 ('LP001013', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2333, 'Urban', 1.0),
 ('LP001014', 'Male', 'Yes', '3+', 'Graduate', 'No', 3036, 'Semiurban', 0.0),
 ('LP001018', 'Male', 'Yes', '2', 'Graduate', 'No', 4006, 'Urban', 1.0),
 ('LP001020', 'Male', 'Yes', '1', 'Graduate', 'No', 12841, 'Semiurban', 1.0)]

#### Default Gender: Not Specified

In [15]:
%%sql
UPDATE CustomerData
SET Gender = 'Not Specified'
WHERE Gender is null;

select* from CustomerData limit 10;

 * sqlite:///Loans.db
13 rows affected.
Done.

[('LP001002', 'Male', 'No', '0', 'Graduate', 'No', 5849, 'Urban', 1.0),
 ('LP001003', 'Male', 'Yes', '1', 'Graduate', 'No', 4583, 'Rural', 1.0),
 ('LP001005', 'Male', 'Yes', '0', 'Graduate', 'Yes', 3000, 'Urban', 1.0),
 ('LP001006', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2583, 'Urban', 1.0),
 ('LP001008', 'Male', 'No', '0', 'Graduate', 'No', 6000, 'Urban', 1.0),
 ('LP001011', 'Male', 'Yes', '2', 'Graduate', 'Yes', 5417, 'Urban', 1.0),
 ('LP001013', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2333, 'Urban', 1.0),
 ('LP001014', 'Male', 'Yes', '3+', 'Graduate', 'No', 3036, 'Semiurban', 0.0),
 ('LP001018', 'Male', 'Yes', '2', 'Graduate', 'No', 4006, 'Urban', 1.0),
 ('LP001020', 'Male', 'Yes', '1', 'Graduate', 'No', 12841, 'Semiurban', 1.0)]

### Deleting Null rows

In [16]:
%%sql
DELETE from LoanData where LoanAmount is null

 * sqlite:///Loans.db
22 rows affected.

[]

### DISTINCT Keyword

In [17]:
%%sql 
SELECT DISTINCT(Property_Area) from CustomerData;

 * sqlite:///Loans.db
Done.

[('Urban',), ('Rural',), ('Semiurban',)]

### Number of rows in both the Tables

In [18]:
%%sql
SELECT count(*) FROM LoanData

 * sqlite:///Loans.db
Done.

[(592,)]

In [19]:
%%sql
SELECT count(*) FROM CustomerData

 * sqlite:///Loans.db
Done.

[(614,)]

### Natural Join

In [20]:
%%sql
SELECT count(*) as Number_of_Rows FROM LoanData natural join CustomerData

 * sqlite:///Loans.db
Done.

[(592,)]

### Full Outer Join

In [21]:
%%sql
SELECT count(*) as Number_of_Rows FROM LoanData FULL OUTER join CustomerData on LoanData.Loan_ID = CustomerData.Loan_ID

 * sqlite:///Loans.db
Done.

[(614,)]

### Inner Join

In [22]:
%%sql
SELECT count(*) as Number_of_Rows FROM LoanData inner join CustomerData on LoanData.Loan_ID = CustomerData.Loan_ID

 * sqlite:///Loans.db
Done.

[(592,)]

### Left Outer Join

In [23]:
%%sql
SELECT count(*) as Number_of_Rows FROM LoanData left outer join CustomerData on LoanData.Loan_ID = CustomerData.Loan_ID

 * sqlite:///Loans.db
Done.

[(592,)]

### Right Outer Join

In [24]:
%%sql
SELECT count(*) as Number_of_Rows FROM LoanData right outer join CustomerData on LoanData.Loan_ID = CustomerData.Loan_ID

 * sqlite:///Loans.db
Done.

[(614,)]

### Adding CONSTRAINTS

In [25]:
%%sql

CREATE TABLE Loan (
    Loan_ID text PRIMARY KEY not null,
    LoanAmount real not null,
    Loan_Amount_Term real,
    Loan_Status text
);

 * sqlite:///Loans.db
Done.

[]

### SELECT INTO Equivalent of SQLite

In [26]:
%%sql
INSERT INTO Loan (Loan_ID, LoanAmount, Loan_Amount_Term, Loan_Status)
SELECT Loan_ID, LoanAmount, Loan_Amount_Term, Loan_Status FROM LoanData;

 * sqlite:///Loans.db
592 rows affected.

[]

In [27]:
%%sql
select * from Loan limit 5;

 * sqlite:///Loans.db
Done.

[('LP001003', 128.0, 360.0, 'N'),
 ('LP001005', 66.0, 360.0, 'Y'),
 ('LP001006', 120.0, 360.0, 'Y'),
 ('LP001008', 141.0, 360.0, 'Y'),
 ('LP001011', 267.0, 360.0, 'Y')]

### DROP Table

In [28]:
%%sql
DROP TABLE LoanData;

 * sqlite:///Loans.db
Done.

[]

### Rename Table (ALTER Table Statement)

In [29]:
%%sql
ALTER TABLE Loan RENAME TO LoanData;

 * sqlite:///Loans.db
Done.

[]

### PRIMARY Key and NOT NULL Constraints

In [30]:
%%sql
PRAGMA table_info(LoanData);

 * sqlite:///Loans.db
Done.

[(0, 'Loan_ID', 'TEXT', 1, None, 1),
 (1, 'LoanAmount', 'REAL', 1, None, 0),
 (2, 'Loan_Amount_Term', 'REAL', 0, None, 0),
 (3, 'Loan_Status', 'TEXT', 0, None, 0)]

### GROUP BY, ORDER BY AND Natural Join

In [31]:
%%sql
SELECT Education, Loan_Status, count(*) from LoanData natural join CustomerData group by Education, Loan_Status order by count(*) desc;

 * sqlite:///Loans.db
Done.

[('Graduate', 'Y', 331),
 ('Graduate', 'N', 134),
 ('Not Graduate', 'Y', 80),
 ('Not Graduate', 'N', 47)]

### Wildcard LIKE 

#### All entries between Loan ID LP001000 to LP001009

In [32]:
%%sql
select * from LoanData where Loan_ID like 'LP00100_'

 * sqlite:///Loans.db
Done.

[('LP001003', 128.0, 360.0, 'N'),
 ('LP001005', 66.0, 360.0, 'Y'),
 ('LP001006', 120.0, 360.0, 'Y'),
 ('LP001008', 141.0, 360.0, 'Y')]

### Using AND, OR and Aliases

In [33]:
%%sql
select count(*) as SelfEmployedGraduate from CustomerData where Education = 'Graduate' and Self_Employed = 'Yes'

 * sqlite:///Loans.db
Done.

[(65,)]

### BETWEEN Statement

In [34]:
%%sql
select count(*) as Loans_between_2_and_3_lakh from LoanData where LoanAmount between 200 and 300

 * sqlite:///Loans.db
Done.

[(56,)]

### GROUP BY and HAVING Clause with Alias and order by clause

In [35]:
%%sql
select Gender, count(*) as Number_of_Loans from LoanData Natural Join CustomerData group by Gender having LoanAmount > 50 order by Number_of_Loans desc

 * sqlite:///Loans.db
Done.

[('Male', 470), ('Female', 109), ('Not Specified', 13)]